Revit 2027 API
CoordinationModelLinkUtils.GetVisibilityOverride Method
 Gets the visibility override for the provided Coordination Model instance or type.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool GetVisibilityOverride(
	Document document,
	View view,
	Element coordinationModelTypeOrInstance
)
Public Shared Function GetVisibilityOverride (
	document As Document,
	view As View,
	coordinationModelTypeOrInstance As Element
) As Boolean
public:
static bool GetVisibilityOverride(
	Document^ document,
	View^ view,
	Element^ coordinationModelTypeOrInstance
)
static member GetVisibilityOverride :
        document : Document *
        view : View *
        coordinationModelTypeOrInstance : Element -> bool
Parameters
document Document
 The document.
view View
 The view.
coordinationModelTypeOrInstance Element
 The Coordination Model instance or type element.
Return Value
Boolean
 Returns the visibility override for the provided Coordination Model instance or type.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The element coordinationModelTypeOrInstance was not found in the given document. -or- The provided element is not a Coordination Model instance or type.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
Remarks
 By default, the visibility setting has no override and its value is true.
 This setting does not reflect the actual visibility in canvas. For example, if a Coordination Model instance has this visibility setting on true, it won't be visible if its Coordination Model type is hidden.
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace